MerouaneGuettache/GroundBasedVisualControl/PSoC_setup/VDAC Example/VDAC_Example/Design01.svd
        <register>
          <name>ADC_DEC_OCOR</name>
          <description>Decimator Offset Correction Coefficient (Low Byte) Register</description>
          <addressOffset>0x40004E08</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>ocor_low</name>
              <description>Offset correction coefficient bits [7:0] (of [23:0]).</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DEC_OCORM</name>
          <description>Decimator Offset Correction Coefficient (Middle Byte) Register</description>
          <addressOffset>0x40004E09</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>ocor_mid</name>
              <description>Offset correction coefficient bits [15:8] (of [23:0]).</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DEC_OCORH</name>
          <description>Decimator Offset Correction Coefficient (High Byte) Register</description>
          <addressOffset>0x40004E0A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>ocor_high</name>
              <description>Offset correction coefficient bits [23:16] (of [23:0]).</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DEC_GCOR</name>
          <description>Decimator Gain Correction Coefficient (Low Byte) Register</description>
          <addressOffset>0x40004E0C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>gcor_low</name>
              <description>Gain correction coefficient bits [7:0] (of [15:0]).</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DEC_GCORH</name>
          <description>Decimator Gain Correction Coefficient (High Byte) Register</description>
          <addressOffset>0x40004E0D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>gcor_high</name>
              <description>Gain correction coefficient bits [15:8] (of [15:0]).</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DEC_GVAL</name>
          <description>Decimator Gain Correction Size Register</description>
          <addressOffset>0x40004E0E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>gval</name>
              <description>Number of valid bits minus one in Gain Coefficient registers GCORH and GCOR.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DEC_OUTSAMP</name>
          <description>Decimator Output Data Sample (Low Byte) Register</description>
          <addressOffset>0x40004E10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>samp_low</name>
              <description>Low order byte of the filter conversion result, bits [7:0] (of [23:0]) --- Or if the out_align bit is set it contains bits [15:8] (of [23:0]).</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DEC_OUTSAMPM</name>
          <description>Decimator Output Data Sample (Middle Byte) Register</description>
          <addressOffset>0x40004E11</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>samp_mid</name>
              <description>Middle order byte of the filter conversion result, bits [15:8] (of [23:0]) --- Or if the out_align bit is set it contains bits [23:16] (of [23:0]).</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DEC_OUTSAMPH</name>
          <description>Decimator Output Data Sample (High Byte) Register</description>
          <addressOffset>0x40004E12</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>samp_high</name>
              <description>High order byte of the filter conversion result, bits [23:16] (of [23:0]).</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DEC_COHER</name>
          <description>Decimator Coherency Register</description>
          <addressOffset>0x40004E14</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>gcor_key</name>
              <description>Sets the Key Coherency Byte of the GCOR/GCORH/GVAL field.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GCOR_KEY_OFF</name>
                  <description>Gain Coefficient Coherency checking off.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCOR_KEY_LOW</name>
                  <description>Key Byte is low byte (GCOR).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCOR_KEY_MID</name>
                  <description>Key Byte is middle byte (GCORH).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCOR_KEY_HIGH</name>
                  <description>Key Byte is high byte (GVAL).</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ocor_key</name>
              <description>Sets the Key Coherency Byte of the OCOR/OCORM/OCORH field.</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OCOR_KEY_OFF</name>
                  <description>Offset Coefficient Coherency checking off.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCOR_KEY_LOW</name>
                  <description>Key Byte is low byte (OCOR).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCOR_KEY_MID</name>
                  <description>Key Byte is middle byte (OCORM).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCOR_KEY_HIGH</name>
                  <description>Key Byte is high byte (OCORH).</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>samp_key</name>
              <description>Sets the Key Coherency Byte of the OUTSAMP/OUTSAMPM/OUTSAMPH field.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAMP_KEY_OFF</name>
                  <description>Output Sample Coherency checking off.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMP_KEY_LOW</name>
                  <description>Key Byte is low byte (OUTSAMP).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMP_KEY_MID</name>
                  <description>Key Byte is middle byte (OUTSAMPM).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMP_KEY_HIGH</name>
                  <description>Key Byte is high byte (OUTSAMPH).</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DSM_CR0</name>
          <description>Delta Sigma Modulator Control Register 0</description>
          <addressOffset>0x40005880</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>nonov</name>
              <description>Non overlap delay of clock phases.</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONOV_LOW</name>
                  <description>low (1.57ns, typ).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONOV_MEDIUM</name>
                  <description>medium (3.54ns, typ).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONOV_HIGH</name>
                  <description>high (6.47ns, typ).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONOV_VERYHIGH</name>
                  <description>very high (9.91ns, typ).</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>qlev</name>
              <description>Quantization Level choice for modulator.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QLEV_2</name>
                  <description>2 level quantization.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QLEV_3</name>
                  <description>3 level quantization.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QLEV_9</name>
                  <description>9 level quantization.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QLEV_9_ALSO</name>
                  <description>9 level quantization.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DSM_CR1</name>
          <description>Delta Sigma Modulator Control Register 1</description>
          <addressOffset>0x40005881</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>dpmode</name>
              <description>Datapath mode.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPMODE_NORMAL</name>
                  <description>normal.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPMODE_LOWOFFSET</name>
                  <description>low offset.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>oden</name>
              <description>Overload detect scheme enable.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>odet_th</name>
              <description>Overload detection threshold. If the number of continuous 1s or 0s coming out of quantizer exceeds this number overload detection flag is set.</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DSM_CR2</name>
          <description>Delta Sigma Modulator Control Register 2</description>
          <addressOffset>0x40005882</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>mx_reset</name>
              <description>select DSM reset source.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MXSELRESET_0</name>
                  <description>Select Decimator for reset source.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MXSELRESET_1</name>
                  <description>Select UDB for reset source.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>reset3_en</name>
              <description>allow third stage integrating capacitance to be reset.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET3_EN_DISABLE</name>
                  <description>third stage integrating capacitance cannot be reset (use only for debug purposes).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET3_EN_ENABLE</name>
                  <description>third stage integrating capacitance can be reset.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>reset2_en</name>
              <description>allow second stage integrating capacitance to be reset.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET2_EN_DISABLE</name>
                  <description>second stage integrating capacitance cannot be reset (use when in overload, to allow for second order operation, assuming the reset1_en bit is also cleared.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET2_EN_ENABLE</name>
                  <description>second stage integrating capacitance can be reset.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>reset1_en</name>
              <description>Allow first stage integrating capacitance to be reset.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET1_EN_DISABLE</name>
                  <description>First stage integrating capacitance cannot be reset (use when in overload, to allow for first order operation).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET1_EN_ENABLE</name>
                  <description>First stage integrating capacitance can be reset.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>mod_chop_en</name>
              <description>Enable Modulator Chopping.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MOD_CHOP_DIS</name>
                  <description>Disable modulator chopping.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOD_CHOP_EN</name>
                  <description>Enable modulator chopping.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>fchop</name>
              <description>Chopping Frequency Selection. The Fclock is samply frequency clock.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FCHOP_DIV2</name>
                  <description>Fclock/2.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCHOP_DIV4</name>
                  <description>Fclock/4.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCHOP_DIV8</name>
                  <description>Fclock/8.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCHOP_DIV16</name>
                  <description>Fclock/16.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCHOP_DIV32</name>
                  <description>Fclock/32.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCHOP_DIV64</name>
                  <description>Fclock/64.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCHOP_DIV128</name>
                  <description>Fclock/128.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCHOP_DIV256</name>
                  <description>Fclock/256.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
