MerouaneGuettache/GroundBasedVisualControl/PSoC_setup/VDAC Example/VDAC_Example/Design01.svd
        <register>
          <name>ADC_DSM_CR11</name>
          <description>Delta Sigma Modulator Control Register 11</description>
          <addressOffset>0x4000588B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>sumcap3_en</name>
              <description>Enabling/Disabling the additional 50fF path that lies between the third integrator output and summer input (feed-forward) path.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUMCAP3_EN_DISABLE</name>
                  <description>Disable the additional 50fF capacitance path.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAP3_EN_ENABLE</name>
                  <description>Enable the additional 50fF capacitance path.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>sumcap3</name>
              <description>The summer capacitance that lies on the feed-forward path from the third integrator output (0fF to 350fF in 50fF step.</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUMCAP3_0FEMPTO</name>
                  <description>0fF.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAP3_50FEMPTO</name>
                  <description>50fF.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAP3_100FEMPTO</name>
                  <description>100fF.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAP3_150FEMPTO</name>
                  <description>150fF.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAP3_200FEMPTO</name>
                  <description>200fF.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAP3_250FEMPTO</name>
                  <description>250fF.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAP3_300FEMPTO</name>
                  <description>300fF.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAP3_350FEMPTO</name>
                  <description>350fF.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>sumcapfb</name>
              <description>The summer feedback capacitance (0fF to 750F in 50fF step).</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUMCAPFB_0FEMPTO</name>
                  <description>0fF.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPFB_50FEMPTO</name>
                  <description>50fF.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPFB_100FEMPTO</name>
                  <description>100fF.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPFB_150FEMPTO</name>
                  <description>150fF.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPFB_200FEMPTO</name>
                  <description>200fF.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPFB_250FEMPTO</name>
                  <description>250fF.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPFB_300FEMPTO</name>
                  <description>300fF.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPFB_350FEMPTO</name>
                  <description>350fF.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPFB_400FEMPTO</name>
                  <description>400fF.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPFB_450FEMPTO</name>
                  <description>450fF.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPFB_500FEMPTO</name>
                  <description>500fF.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPFB_550FEMPTO</name>
                  <description>550fF.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPFB_600FEMPTO</name>
                  <description>600fF.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPFB_650FEMPTO</name>
                  <description>650fF.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPFB_700FEMPTO</name>
                  <description>700fF.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPFB_750FEMPTO</name>
                  <description>750fF.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DSM_CR12</name>
          <description>Delta Sigma Modulator Control Register 12</description>
          <addressOffset>0x4000588C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>sumcapfb_en</name>
              <description>Enabling/Disabling the DFT path that lies on the feedback path of the active summer.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUMCAPFB_EN_DISABLE</name>
                  <description>Disable the DFT 50fF capacitance path.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPFB_EN_ENABLE</name>
                  <description>Enable the DFT 50fF capacitance path.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>sumcapin_en</name>
              <description>Enabling/Disabling the DFT path that lies between input of the sigma delta modulator and the summer input..</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUMCAPIN_EN_DISABLE</name>
                  <description>Disable the DFT 50fF capacitance path.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_EN_ENABLE</name>
                  <description>Enable the DFT 50fF capacitance path.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>sumcapin</name>
              <description>The summer capacitance that lies on the path where the input signal is summed (50fF to 1.6pF in 50fF step).</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUMCAPIN_0FEMPTO</name>
                  <description>0fF.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_50FEMPTO</name>
                  <description>50fF.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_100FEMPTO</name>
                  <description>100fF.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_150FEMPTO</name>
                  <description>150fF.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_200FEMPTO</name>
                  <description>200fF.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_250FEMPTO</name>
                  <description>250fF.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_300FEMPTO</name>
                  <description>300fF.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_350FEMPTO</name>
                  <description>350fF.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_400FEMPTO</name>
                  <description>400fF.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_450FEMPTO</name>
                  <description>450fF.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_500FEMPTO</name>
                  <description>500fF.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_550FEMPTO</name>
                  <description>550fF.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_600FEMPTO</name>
                  <description>600fF.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_650FEMPTO</name>
                  <description>650fF.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_700FEMPTO</name>
                  <description>700fF.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_750FEMPTO</name>
                  <description>750fF.</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_800FEMPTO</name>
                  <description>800fF.</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_850FEMPTO</name>
                  <description>850fF.</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_900FEMPTO</name>
                  <description>900fF.</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_950FEMPTO</name>
                  <description>950fF.</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_1000FEMPTO</name>
                  <description>1000fF.</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_1050FEMPTO</name>
                  <description>1050fF.</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_1100FEMPTO</name>
                  <description>1100fF.</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_1150FEMPTO</name>
                  <description>1150fF.</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_1200FEMPTO</name>
                  <description>1200fF.</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_1250FEMPTO</name>
                  <description>1250fF.</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_1300FEMPTO</name>
                  <description>1300fF.</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_1350FEMPTO</name>
                  <description>1350fF.</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_1400FEMPTO</name>
                  <description>1400fF.</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_1450FEMPTO</name>
                  <description>1450fF.</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_1500FEMPTO</name>
                  <description>1500fF.</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUMCAPIN_1550FEMPTO</name>
                  <description>1550fF.</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DSM_CR13</name>
          <description>Delta Sigma Modulator Control Register 13</description>
          <addressOffset>0x4000588D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>ADC_DSM_CR14</name>
          <description>Delta Sigma Modulator Control Register 14</description>
          <addressOffset>0x4000588E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>opamp1_bw</name>
              <description>First Stage Opamp Bandwidth Control (Risk Mitigation not for User control). Table gives value for Modulator input bw[3:0].</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPAMP1_BW_0x0</name>
                  <description>(default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPAMP1_BW_0x1</name>
                  <description>(used with 1.5X power)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPAMP1_BW_0x2</name>
                  <description>reserved</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPAMP1_BW_0x3</name>
                  <description>(used with 2X power)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPAMP1_BW_0x4</name>
                  <description>reserved</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPAMP1_BW_0x5</name>
                  <description>reserved</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPAMP1_BW_0x6</name>
                  <description>reserved</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPAMP1_BW_0x7</name>
                  <description>(used with 2.5X power)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPAMP1_BW_0x8</name>
                  <description>(higher BW, 1.25X power)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPAMP1_BW_0x9</name>
                  <description>(lower noise)</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPAMP1_BW_0xA</name>
                  <description>reserved</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPAMP1_BW_0xB</name>
                  <description>reserved</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPAMP1_BW_0xC</name>
                  <description>reserved</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPAMP1_BW_0xD</name>
                  <description>reserved</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPAMP1_BW_0xE</name>
                  <description>reserved</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPAMP1_BW_0xF</name>
                  <description>reserved</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>power1</name>
              <description>First Stage Opamp Power level control.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWER1_0</name>
                  <description>Low (44uA)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER1_1</name>
                  <description>Medium (123uA)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER1_2</name>
                  <description>High (492uA)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER1_3</name>
                  <description>1.5X (750uA)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER1_4</name>
                  <description>2X (1mA)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER1_5</name>
                  <description>C/2 @ 3MSPS (277uA)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER1_6</name>
                  <description>C/4 @ 3MSPS (185uA)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER1_7</name>
                  <description>2.5X (1.5mA)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
