MerouaneGuettache/GroundBasedVisualControl/PSoC_setup/VDAC Example/VDAC_Example/Design01.svd
        <register>
          <name>ADC_DSM_REF2</name>
          <description>Delta Sigma Modulator Reference Register 2</description>
          <addressOffset>0x40005894</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>s7_en</name>
              <description>If Set, closes the S7 switch in figure Sigma Delta Channel Analog Reference Selection in the DSM chapter; See sub-section Analog Reference Options for the Sigma Delta Channel.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>s6_en</name>
              <description>If Set, closes the S6 switch in figure Sigma Delta Channel Analog Reference Selection in the DSM chapter; See sub-section Analog Reference Options for the Sigma Delta Channel.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>s5_en</name>
              <description>If Set, closes the S5 switch in figure Sigma Delta Channel Analog Reference Selection in the DSM chapter; See sub-section Analog Reference Options for the Sigma Delta Channel.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>s4_en</name>
              <description>If Set, closes the S4 switch in figure Sigma Delta Channel Analog Reference Selection in the DSM chapter; See sub-section Analog Reference Options for the Sigma Delta Channel.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>s3_en</name>
              <description>If Set, closes the S3 switch in figure Sigma Delta Channel Analog Reference Selection in the DSM chapter; See sub-section Analog Reference Options for the Sigma Delta Channel.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>s2_en</name>
              <description>If Set, closes the S2 switch in figure Sigma Delta Channel Analog Reference Selection in the DSM chapter; See sub-section Analog Reference Options for the Sigma Delta Channel.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>s1_en</name>
              <description>If Set, closes the S1 switch in figure Sigma Delta Channel Analog Reference Selection in the DSM chapter; See sub-section Analog Reference Options for the Sigma Delta Channel.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>s0_en</name>
              <description>If Set, closes the S0 switch in figure Sigma Delta Channel Analog Reference Selection in the DSM chapter; See sub-section Analog Reference Options for the Sigma Delta Channel.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DSM_REF3</name>
          <description>Delta Sigma Modulator Reference Register 3</description>
          <addressOffset>0x40005895</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>s13_en</name>
              <description>If Set, closes the S13 switch in figure Sigma Delta Channel Analog Reference Selection in the DSM chapter; See sub-section Analog Reference Options for the Sigma Delta Channel.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>s12_en</name>
              <description>If Set, closes the S12 switch in figure Sigma Delta Channel Analog Reference Selection in the DSM chapter; See sub-section Analog Reference Options for the Sigma Delta Channel.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>s11_en</name>
              <description>If Set, closes the S11 switch in figure Sigma Delta Channel Analog Reference Selection in the DSM chapter; See sub-section Analog Reference Options for the Sigma Delta Channel.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>s10_en</name>
              <description>If Set, closes the S10 switch in figure Sigma Delta Channel Analog Reference Selection in the DSM chapter; See sub-section Analog Reference Options for the Sigma Delta Channel.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>s9_en</name>
              <description>If Set, closes the S9 switch in figure Sigma Delta Channel Analog Reference Selection in the DSM chapter; See sub-section Analog Reference Options for the Sigma Delta Channel.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>s8_en</name>
              <description>If Set, closes the S8 switch in figure Sigma Delta Channel Analog Reference Selection in the DSM chapter; See sub-section Analog Reference Options for the Sigma Delta Channel.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DSM_DEM0</name>
          <description>Delta Sigma Modulator Dynamic Element Matching Register 0</description>
          <addressOffset>0x40005896</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>demtest_src</name>
              <description>Select demtest source.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEMTEST_SRC_REG</name>
                  <description>ANAIF register source selected - DSM#_DEM1.demtest[7:0].</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEMTEST_SRC_UDB</name>
                  <description>UDB array source selected - dsi_anaif_dft[7:0].</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>adc_test_en</name>
              <description>Enable/Disable All test modes in Sigma Delta Channel.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_TEST_EN_0</name>
                  <description>Disable all test modes for the sigma delta channel.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_TEST_EN_1</name>
                  <description>Enable all test modes for the sigma delta channel.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>en_dem</name>
              <description>Enable DEM.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN_DEM_DISABLE</name>
                  <description>Disable DEM</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_DEM_ENABLE</name>
                  <description>Enable DEM</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>en_scrambler1</name>
              <description>Enable Scrambler 1.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN_SCRAMBLER1_DISABLE</name>
                  <description>Disable Scrambler 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_SCRAMBLER1_ENABLE</name>
                  <description>Enable Scrambler 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>en_scrambler0</name>
              <description>Enable Scrambler 0.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN_SCRAMBLER0_DISABLE</name>
                  <description>Disable Scrambler 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_SCRAMBLER0_ENABLE</name>
                  <description>Enable Scrambler 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DSM_DEM1</name>
          <description>Delta Sigma Modulator Dynamic Element Matching Register 1</description>
          <addressOffset>0x40005897</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>demtest</name>
              <description>Register control for the DAC unit elements inside the first integrator. This can be used when bit DSM.DEM0[3], adc_test_en, is set. If the adc_test_en is not set the the control logic inside the modulator determines how the DAC unit elements are controlled. This is meant for static testing purposes.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DSM_TST0</name>
          <description>Delta Sigma Modulator Test Register 0</description>
          <addressOffset>0x40005898</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>dig_test_sel</name>
              <description>To test various digital outputs to digital muxes (for DFT).</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIG_TEST_SEL_0</name>
                  <description>test_dig_out = vhi</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIG_TEST_SEL_1</name>
                  <description>test_dig_out = hi</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIG_TEST_SEL_2</name>
                  <description>test_dig_out = med</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIG_TEST_SEL_3</name>
                  <description>test_dig_out = low</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIG_TEST_SEL_4</name>
                  <description>test_dig_out = sign</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIG_TEST_SEL_5</name>
                  <description>test_dig_out = reset_ov</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIG_TEST_SEL_6</name>
                  <description>test_dig_out = TESTMODE and Phi1 (sampling clock phase)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIG_TEST_SEL_7</name>
                  <description>test_dig_out = TESTMODE and fchclk (chopping clock)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>refsel_ctrl</name>
              <description>This is the 4-bit encoded value which selects one among the 15 important DFT observable points inside the DSM. 4'h0 (0000) through 4'ha (1010) selects between various tap points in the quantizer resistor ladder. 4'hb (1011) through 4'he (1110) selects special points inside the DSM.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFSEL_CTRL_0</name>
                  <description>(9/32)*Vref</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFSEL_CTRL_1</name>
                  <description>(11/32)*Vref</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFSEL_CTRL_2</name>
                  <description>(12/32)*Vref</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFSEL_CTRL_3</name>
                  <description>(13/32)*Vref</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFSEL_CTRL_4</name>
                  <description>(15/32)*Vref</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFSEL_CTRL_5</name>
                  <description>(16/32)*Vref</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFSEL_CTRL_6</name>
                  <description>(17/32)*Vref</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFSEL_CTRL_7</name>
                  <description>(19/32)*Vref</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFSEL_CTRL_8</name>
                  <description>(20/32)*Vref</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFSEL_CTRL_9</name>
                  <description>(21/32)*Vref</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFSEL_CTRL_10</name>
                  <description>(23/32)*Vref</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFSEL_CTRL_11</name>
                  <description>Selects VICM (Input Common Mode) applied to DSM to be available at Ref_out DFT point</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFSEL_CTRL_12</name>
                  <description>Selects Vb0 (2nd and 3rd integrator Opamp Bias Voltage) inside the DSM to Ref_out DFT point</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFSEL_CTRL_13</name>
                  <description>Selects VRCM (Half of applied Reference) inside the DSM to Ref_out DFT point</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFSEL_CTRL_14</name>
                  <description>Selects vbias0_int, an internal bias point from inside the DSM to Ref_out DFT point</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFSEL_CTRL_15</name>
                  <description>Not a valid selection</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DSM_TST1</name>
          <description>Delta Sigma Modulator Test Register 1</description>
          <addressOffset>0x40005899</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>ADC_DSM_BUF0</name>
          <description>Delta Sigma Modulator Buffer Register 0</description>
          <addressOffset>0x4000589A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>rail_rail_en</name>
              <description>Selects Rail-to-Rail Mode.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RAIL_RAIL_EN_DISABLE</name>
                  <description>Level shifted mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAIL_RAIL_EN_ENABLE</name>
                  <description>Rail-to-Rail mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>bypass_p</name>
              <description>Remove positive half of the buffer from signal path.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYPASS_P_0</name>
                  <description>The buffer in the positive half remains on the signal path (Refer Fig 33-2)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYPASS_P_1</name>
                  <description>bypass the buffer on the positive half of the signal path (Refer Fig 33-2)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>enable_p</name>
              <description>Buffer Positive Half Enable.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_P_0</name>
                  <description>power down buffer in positive half</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_P_1</name>
                  <description>enable positive half of buffer</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
